20220801134945-functiongraph.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-02 Fri 10:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FunctionGraph</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">FunctionGraph</h1>

<div id="outline-container-org826b00c" class="outline-2">
<h2 id="org826b00c"><span class="todo TODO">TODO</span> How do we initialize a <code>FunctionGraph</code>?</h2>
</div>
<div id="outline-container-orgc8603a3" class="outline-2">
<h2 id="orgc8603a3"><span class="todo TODO">TODO</span> What does a <code>FunctionGraph</code> do that a variable given by a <code>TensorVariable</code> does not?</h2>
</div>
<div id="outline-container-org1f6280a" class="outline-2">
<h2 id="org1f6280a"><span class="todo TODO">TODO</span> What are <code>Features</code>?</h2>
</div>
<div id="outline-container-org2760b4e" class="outline-2">
<h2 id="org2760b4e"><span class="todo TODO">TODO</span> What functionalities of <code>FunctionGraphs</code> are needed where?</h2>
<div class="outline-text-2" id="text-org2760b4e">
<p>
Need to draw a map of where the different <code>FunctionGraph</code> functionalities could be used.
</p>
</div>
</div>

<div id="outline-container-org7cd5595" class="outline-2">
<h2 id="org7cd5595">Misc</h2>
<div class="outline-text-2" id="text-org7cd5595">
<p>
From the documentation:
</p>

<blockquote>
<p>
A `FunctionGraph` represents a subgraph bound by a set of input variables and
a set of output variables, ie a subgraph that specifies an Aesara function.
The inputs list should contain all the inputs on which the outputs depend.
`Variable`\s of type `Constant` are not counted as inputs.
</p>

<p>
The `FunctionGraph` supports the replace operation which allows to replace
a variable in the subgraph by another, e.g. replace ``(x + x).out`` by
``(2 * x).out``. This is the basis for optimization in Aesara.
</p>

<p>
This class is also responsible for verifying that a graph is valid
(ie, all the dtypes and broadcast patterns are compatible with the
way the `Variable`\s are used) and for tracking the `Variable`\s with
a :attr:`FunctionGraph.clients` ``dict`` that specifies which `Apply` nodes
use the `Variable`.  The :attr:`FunctionGraph.clients` field, combined with
the :attr:`Variable.owner` and each :attr:`Apply.inputs`, allows the graph
to be traversed in both directions.
</p>

<p>
It can also be extended with new features using
:meth:`FunctionGraph.attach<sub>feature</sub>`.  See `Feature` for event types and
documentation.  Extra features allow the `FunctionGraph` to verify new
properties of a graph as it is optimized.
</p>
</blockquote>

<p>
What I am wondering is: when is a <code>FunctionGraph</code> needed? When does it become cumbersome?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> aesara
<span style="color: #F0DFAF; font-weight: bold;">from</span> aesara.graph.fg <span style="color: #F0DFAF; font-weight: bold;">import</span> FunctionGraph
<span style="color: #F0DFAF; font-weight: bold;">import</span> aesara.tensor <span style="color: #F0DFAF; font-weight: bold;">as</span> at

<span style="color: #DFAF8F;">x</span> = at.vector(<span style="color: #CC9393;">'x'</span>)
<span style="color: #DFAF8F;">z</span> = at.log(at.exp(x + x)) + x + x

<span style="color: #DFAF8F;">fg</span> = FunctionGraph(outputs=[z])

aesara.dprint(fg)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span>(fg.clients)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c3b0bd" class="outline-2">
<h2 id="org8c3b0bd"><span class="todo TODO">TODO</span> What is the <code>clients</code> dictionary used for?</h2>
<div class="outline-text-2" id="text-org8c3b0bd">
<p>
It looks like this is what allows to traverse the graph?
</p>
</div>
</div>

<div id="outline-container-orgf3a6640" class="outline-2">
<h2 id="orgf3a6640"><span class="todo TODO">TODO</span> Keep track of where a <code>FunctionGraph</code> is necessary, where it is produced, where it is cloned, etc.</h2>
</div>

<div id="outline-container-org76742f7" class="outline-2">
<h2 id="org76742f7">Links to this note</h2>
<div class="outline-text-2" id="text-org76742f7">
<ul class="org-ul">
<li><a href="./20220729163627-aesara.html">Aesara</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>